
'''
Пользователь вводит строку. Разрежьте её на две равные части (если длина строки —
чётная, а если длина строки нечётная, то длина первой части должна быть на один
символ больше). Переставьте эти две части местами, результат запишите в новую
строку и выведите на экран.
'''

# text = input("Enter your text: ")
text = 'qwerty'

print((len(text)/2))

# if len(text) % 2 == 0:
# #     l1 = text[:(len(text)/2)]
# #
# # else: